# ====================================================================
# ЭТОТ ФАЙЛ СГЕНЕРИРОВАН АВТОМАТИЧЕСКИ ИЗ ТАБЛИЦ.
# НЕ ПРАВЬТЕ ЕГО РУКАМИ! ДЛЯ ОБНОВЛЕНИЯ ЗАПУСТИТЕ СКРИПТ ГЕНЕРАЦИИ.
# ====================================================================

LIST_OF_TASKS = [
	{'content': 'Подготовить квартальный отчет', 'priority': 4},
	{'content': 'Организовать рабочую встречу', 'due': {'string': 'сегодня'}, 'priority': 1, 'labels': ['срочно']},
	{'content': 'Проверить новые уведомления', 'due': {'string': 'послезавтра в 17:00'}, 'priority': 3, 'labels': ['срочно']},
	{'content': 'Созвониться с ключевым клиентом', 'due': {'string': 'сегодня'}, 'priority': 4, 'labels': ['срочно', 'важно']},
	{'content': 'Купить расходные материалы', 'due': {'string': 'завтра в 17:00'}, 'priority': 3, 'labels': ['срочно', 'важно']},
	{'content': 'Проанализировать текущие метрики', 'due': {'string': 'послезавтра'}, 'priority': 3, 'labels': ['срочно', 'важно']},
	{'content': 'Исправить критические ошибки', 'due': {'string': 'завтра'}, 'priority': 4, 'labels': ['срочно']},
	{'content': 'Обновить проектную документацию', 'due': {'string': 'послезавтра'}, 'priority': 3, 'labels': ['срочно', 'важно']},
	{'content': 'Согласовать план разработки', 'due': {'string': 'завтра'}, 'priority': 4, 'labels': ['срочно']},
	{'content': 'Протестировать новый функционал', 'due': {'string': 'завтра в 17:00'}, 'priority': 4, 'labels': ['важно', 'срочно']},
]

ORDERING_TEST_DATA = [
	{'group_by': 'Приоритет', 'sort_by': 'Название', 'direction': 'По убыванию'},
	{'group_by': 'Приоритет', 'sort_by': 'Приоритет', 'direction': 'По возрастанию'},
	{'group_by': 'Приоритет', 'sort_by': 'Срок', 'direction': 'По возрастанию'},
	{'group_by': 'Срок', 'sort_by': 'Название', 'direction': 'По возрастанию'},
	{'group_by': 'Срок', 'sort_by': 'Приоритет', 'direction': 'По убыванию'},
	{'group_by': 'Срок', 'sort_by': 'Срок', 'direction': 'По убыванию'},
	{'group_by': 'Метка', 'sort_by': 'Название', 'direction': 'По возрастанию'},
	{'group_by': 'Метка', 'sort_by': 'Срок', 'direction': 'По убыванию'},
	{'group_by': 'Метка', 'sort_by': 'Приоритет', 'direction': 'По возрастанию'},
]

